In [1]:
!pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\programdata\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [2]:
import pandas as pd

In [38]:
# importing Sungrow file and removing the starting rows
df1 = pd.read_csv("10.csv",skiprows = 4)

In [39]:
# checking the columns header names
df1.columns

Index(['Plant', 'Installed Power (kWp)', 'Grid-connection Date',
       'Yield Today (kWh)', 'Total Yield (kWh)', 'Today Revenue',
       'Total COâ‚‚ reduction (kg)', 'Plant Address'],
      dtype='object')

In [42]:
#removing the extra columns
df1= df1[['Plant', 'Installed Power (kWp)', 'Yield Today (kWh)']]

In [43]:
# checking the columns header names
df1.columns

Index(['Plant', 'Installed Power (kWp)', 'Yield Today (kWh)'], dtype='object')

In [45]:
# Renaming required columns
df2 = df1.rename(columns={
    'Plant': 'Site Name',
    'Installed Power (kWp)': 'DC Capacity',
    'Yield Today (kWh)': 'Generation'
})
# Remove name after space in 'Site Name' column
df2['Site Name'] = df2['Site Name'].str.split().str[0]
# checking the table
df2.head(10)

   Site Name  DC Capacity  Generation
0      Nitte       483.00      1808.0
1        IBM        52.00       132.0
2   District        60.06       271.0
3   District        70.00       363.9
4    Gateway       140.00       361.7
5  Decathlon        70.00       247.8
6  Decathlon        40.50       127.0
7  Decathlon        64.80        91.6
8  Decathlon        42.00       136.8
9  Decathlon        70.00       247.9

In [46]:
# importing the wattmon file and removing the row 1
df51 = pd.read_csv("50.csv",skiprows = 1)

In [47]:
df51.columns

Index(['Site ID', 'Time', 'kW_DC_Capacity', 'kWh_Daily_Generation',
       'kWh_Day_Irradiance'],
      dtype='object')

In [48]:
#removing the extra columns
df51= df51[['Site ID', 'kW_DC_Capacity', 'kWh_Daily_Generation','kWh_Day_Irradiance']]
# checking the table for above code
df51.head()

          Site ID  kW_DC_Capacity  kWh_Daily_Generation  kWh_Day_Irradiance
0              FM          171.14               511.400               3.896
1           SJS 2            0.00                 0.000               0.000
2           SJS 1            0.00                 0.000               0.000
3             IBS          120.00                 0.002               0.000
4  Flipkart_Hosur          100.00               365.000               4.934

In [50]:
# Rename multiple columns
df52 = df51.rename(columns={
    'Site ID': 'Site Name',
    'kW_DC_Capacity': 'DC Capacity',
    'kWh_Daily_Generation': 'Generation',
    'kWh_Day_Irradiance': 'Irradiance'
})
# Remove name after space in 'Site Name' column
df52['Site Name'] = df52['Site Name'].str.split().str[0]
df52.head()

        Site Name  DC Capacity  Generation  Irradiance
0              FM       171.14     511.400       3.896
1             SJS         0.00       0.000       0.000
2             SJS         0.00       0.000       0.000
3             IBS       120.00       0.002       0.000
4  Flipkart_Hosur       100.00     365.000       4.934

In [52]:
# Appending the both files sungrow and wattmon
result = pd.concat([df2, df52], ignore_index=True)
df100=result
df100.head()

  Site Name  DC Capacity  Generation  Irradiance
0     Nitte       483.00      1808.0         NaN
1       IBM        52.00       132.0         NaN
2  District        60.06       271.0         NaN
3  District        70.00       363.9         NaN
4   Gateway       140.00       361.7         NaN

### Save the DataFrame to an Excel file
df100.to_excel("output.xlsx", index=False)

In [53]:
# importing the solaredge file and removing the starting rows
df21 = pd.read_excel("20.xlsx",skiprows = 9)
df21 = df21[:-1]

C:\ProgramData\anaconda3\Lib\site-packages\openpyxl\styles\stylesheet.py:226: UserWarning: Workbook contains no default style, apply openpyxl's default
  warn("Workbook contains no default style, apply openpyxl's default")

In [54]:
df21.columns

Index(['#', 'Site Name', 'Peak Power (kWp)', 'Highest Alert Impact', 'kWh',
       'kWh/kWp'],
      dtype='object')

In [55]:
#removing the extra columns
df21= df21[['Site Name','Peak Power (kWp)','kWh']]

In [56]:
# Rename multiple columns
df22 = df21.rename(columns={
    'Site Name': 'Site Name',
    'Peak Power (kWp)': 'DC Capacity',
    'kWh': 'Generation'
})
# Remove name after space in 'Site Name' column
df22['Site Name'] = df22['Site Name'].str.split().str[0]
df22.head()

     Site Name  DC Capacity  Generation
0     Gokaldas        21.12        76.3
1       Karnal       142.80         0.0
2  Yamunanagar       143.65         0.4

In [57]:
# Appending the 3 files sungrow,wattmon,solaredge
result1 = pd.concat([df2,df52,df22], ignore_index=True)
df200=result1
df200.head()

  Site Name  DC Capacity  Generation  Irradiance
0     Nitte       483.00      1808.0         NaN
1       IBM        52.00       132.0         NaN
2  District        60.06       271.0         NaN
3  District        70.00       363.9         NaN
4   Gateway       140.00       361.7         NaN

In [58]:
# importing the Huawei file and removing the starting rows
df31 = pd.read_excel("30.xlsx",skiprows = 1)

In [59]:
df31.columns

Index(['Plant Name', 'Address', 'Total String Capacity (kWp)',
       'Global Irradiation (kWh/ãŽ¡)', 'Sun Hours (H)',
       'Average Temperature(Â°C)', 'Theoretical Yield (kWh)', 'PV Yield (kWh)',
       ' Inverter Yield (kWh)', 'Total Yield (kWh)', 'Export (kWh)',
       'Specific Energy (kWh/kWp)', 'Import (kWh)',
       'Loss Due to Export Limitation (kWh)',
       'Loss Due to Export Limitation(Rs.)', 'Consumption (kWh)',
       'Self-consumption (kWh)', 'Self-consumption Rate (%)',
       'Peak Power (kW)', 'Performance Ratio(%)', 'Load Rate (%)',
       'COâ‚‚ Avoided (t)', 'Standard Coal Saved (t)', 'Revenue (Rs.)'],
      dtype='object')

In [60]:
#removing the extra columns
df31= df31[['Plant Name','Total String Capacity (kWp)','PV Yield (kWh)']]

In [61]:
# Rename multiple columns
df32 = df31.rename(columns={
    'Plant Name': 'Site Name',
    'Total String Capacity (kWp)': 'DC Capacity',
    'PV Yield (kWh)': 'Generation'
})
# Remove name after space in 'Site Name' column
df32['Site Name'] = df32['Site Name'].str.split().str[0]
df32.head()

  Site Name  DC Capacity  Generation
0         U      399.400      396.85
1         U      550.405     1606.22

In [62]:
# Appending the 4 files sungrow,wattmon,solaredge,huawei
result2 = pd.concat([df2,df22,df32,df52], ignore_index=True)
df300=result2
df300.head()

  Site Name  DC Capacity  Generation  Irradiance
0     Nitte       483.00      1808.0         NaN
1       IBM        52.00       132.0         NaN
2  District        60.06       271.0         NaN
3  District        70.00       363.9         NaN
4   Gateway       140.00       361.7         NaN

# Intermediate Output-1

# Save the DataFrame to an Excel file
df300.to_excel("output2.xlsx", index=True, startrow=1)

In [63]:
df300.columns

Index(['Site Name', 'DC Capacity', 'Generation', 'Irradiance'], dtype='object')

In [64]:
# Adding Yield column in DataFrame
df300['Yield'] = df300['Generation'] / df300['DC Capacity']
# Round the 'Yield' column to 2 decimal places
df300['Yield'] = df300['Yield'].round(2)
df300.head()

  Site Name  DC Capacity  Generation  Irradiance  Yield
0     Nitte       483.00      1808.0         NaN   3.74
1       IBM        52.00       132.0         NaN   2.54
2  District        60.06       271.0         NaN   4.51
3  District        70.00       363.9         NaN   5.20
4   Gateway       140.00       361.7         NaN   2.58

In [65]:
# adding PR column to df300 
df300['PR'] = (df300['Yield'] / df300['Irradiance'])*100
# Round the 'PR' column to 2 decimal places
df300['PR'] = df300['PR'].round(2)
df300.head()

  Site Name  DC Capacity  Generation  Irradiance  Yield  PR
0     Nitte       483.00      1808.0         NaN   3.74 NaN
1       IBM        52.00       132.0         NaN   2.54 NaN
2  District        60.06       271.0         NaN   4.51 NaN
3  District        70.00       363.9         NaN   5.20 NaN
4   Gateway       140.00       361.7         NaN   2.58 NaN

In [66]:
# Replace NaN or empty cells with 0
df300 = df300.fillna(0)

# Replace infinity (inf) values with 0 in the 'PR' column
df300['PR'] = df300['PR'].replace([float('inf')], 0)
df300.head()

  Site Name  DC Capacity  Generation  Irradiance  Yield   PR
0     Nitte       483.00      1808.0         0.0   3.74  0.0
1       IBM        52.00       132.0         0.0   2.54  0.0
2  District        60.06       271.0         0.0   4.51  0.0
3  District        70.00       363.9         0.0   5.20  0.0
4   Gateway       140.00       361.7         0.0   2.58  0.0

In [69]:
# Wattmon capex sites removing
#values_to_remove = ['FM', 'SJS 2', 'SJS 1', 'IBS','SEL 14-CHENNAI','LIPL','SEL 15-Rajasthan','ZF_CHENNAI','ZF_COIMBATORE','SEL 16-Kolar','SEL 8-Bommasandra','SEL 11-Ahmedabad','GT Yamunanagar']

# Remove rows with the specified values in the 'Site Name' column
df300 = df300[~df300['Site Name'].isin(values_to_remove)]
df300.head()

  Site Name  DC Capacity  Generation  Irradiance  Yield   PR
0     Nitte       483.00      1808.0         0.0   3.74  0.0
1       IBM        52.00       132.0         0.0   2.54  0.0
2  District        60.06       271.0         0.0   4.51  0.0
3  District        70.00       363.9         0.0   5.20  0.0
4   Gateway       140.00       361.7         0.0   2.58  0.0

In [71]:
# Sort the DataFrame in descending order by 'DC Capacity' column
df300 = df300.sort_values(by='DC Capacity', ascending=False)

In [72]:
# Reset the index and remove the old index column
df400 = df300.reset_index(drop=True)

# Create the 'Serial No' column
df400.insert(0, 'Serial No', range(1, len(df300) + 1))

# df400

#removing the extra columns
df300= df300[[ 'Serial No','Site Name', 'DC Capacity', 'Generation', 'Irradiance', 'Yield', 'PR'
      ]]
df300.head()

# Save the DataFrame to an Excel file
df300.to_excel("output10.xlsx", index=True, startrow=1)

### Sort the DataFrame in descending order by 'DC Capacity'
df400 = df300.sort_values(by='DC Capacity', ascending=False)

# Reset the index and rename the index column
df400 = df400.reset_index(drop=True)
df400.index = df400.index + 1
df400.index.name = 'S No'
df400.head()

In [73]:
df400.columns

Index(['Serial No', 'Site Name', 'DC Capacity', 'Generation', 'Irradiance',
       'Yield', 'PR'],
      dtype='object')

In [74]:
# Save the DataFrame to an Excel file
#df300.to_excel("DGR.xlsx", index=False, startrow=1)

In [75]:
# Remove rows with non-numeric values in the columns you want to sum
df = df400[pd.to_numeric(df400['DC Capacity'], errors='coerce').notna()]
df = df400[pd.to_numeric(df400['Generation'], errors='coerce').notna()]

# Calculate the sum for 'DC Capacity' and 'Generation' columns
sum_values = df[['DC Capacity', 'Generation']].sum()

# Calculate the average for 'Irradiance', 'Yield', and 'PR' columns
average_values = df[['Irradiance', 'Yield', 'PR']].mean()

# Add a new row with 'Total' values using the loc method
df.loc['Total'] = ['','Total', sum_values['DC Capacity'], sum_values['Generation'],
                   average_values['Irradiance'], average_values['Yield'], average_values['PR']]

# Save the updated DataFrame to a new Excel file
#df.to_excel("DGR_with_summary.xlsx", index=True)

In [76]:
# Convert the 'Yield' column to numeric (if it contains numeric values)
df400['Yield'] = pd.to_numeric(df400['Yield'], errors='coerce')

In [82]:
# Define a function to apply cell colors based on values
def highlight_yield(value):
    if 0 <= value < 3:
        return 'background-color: lightcoral'
    elif 3 <= value < 4:
        return 'background-color: #fcf75e'
    elif 4 <= value < 6:
        return 'background-color: lightgreen'
    else:
        return ''

# Apply the cell coloring to the 'Yield' column
styled_df = df.style.applymap(highlight_yield, subset=['Yield'])

# Display the styled DataFrame
#styled_df


# Define a function to apply cell colors based on values in the 'PR' column
def highlight_pr(value):
    if 0 <= value < 60:
        return 'background-color: lightcoral'
    elif 60 <= value < 80:
        return 'background-color: palegoldenrod'
    elif 80 <= value < 150:
        return 'background-color: lightgreen'
    else:
        return ''

# Apply the cell coloring to the 'PR' column
styled_df = styled_df.applymap(highlight_pr, subset=['PR'])

# Display the styled DataFrame
styled_df

In [83]:
# Save the DataFrame to an Excel file
styled_df.to_excel("DGR.xlsx", index=False, startrow=1)

# Sort the DataFrame in descending order by 'DC Capacity' column
df = df.sort_values(by='DC Capacity', ascending=False)

# Display the sorted DataFrame
df

# Save the sorted DataFrame to an Excel file without the index column
df.to_excel("sorted_DGR.xlsx", index=False)